brew "mise"
brew "stow"
brew "coreutils"
brew "findutils"
brew "tig"
brew "tree"
brew "pwgen"
brew "htop"

# colima は brew services による自動起動のため brew でインストール
brew "colima"
brew "ghostty"

brew "cask"
cask "gcloud-cli"
cask "visual-studio-code"
cask "google-chrome"
cask "obsidian"
cask "resilio-sync"
cask "claude"

brew "mas"
mas "Tailscale", id: 1475387142
